src/cf/maERP_ib/src/InformationRegisters/НепроведенныеДокументы/НепроведенныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НепроведенныеДокументы</name>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/InformationRegisters/НепроведенныеДокументы/ManagerModule.bsl
Процедура ОчиститьОшибки() Экспорт
	НЗ = РегистрыСведений.НепроведенныеДокументы.СоздатьНаборЗаписей();
	НЗ.Записать(Истина);
КонецПроцедуры	

Процедура ЗаписатьОшибку(Док, ТекстОшибки) Экспорт
	МЗ = РегистрыСведений.НепроведенныеДокументы.СоздатьМенеджерЗаписи();
	МЗ.Документ = Док;
	МЗ.ТекстОшибки = ТекстОшибки;
	МЗ.Записать(Истина);
КонецПроцедуры
